app/controllers/products_controller.rb

  def index
    @products = Product.order("name #{params[:direction]}")
---
SELECT "products".* FROM "products" ORDER BY name